Revit 2026 API

# IViewSheetSetViews Property

---

The views.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
ViewSet Views { get; set; }
```
```vb
Property Views As ViewSet
	Get
	Set
```
```cpp
property ViewSet^ Views {
	ViewSet^ get ();
	void set (ViewSet^ value);
}
```
```fsharp
abstract Views : ViewSet with get, set
```

#### Property Value

ViewSet

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the input views is . |
| InvalidOperationException | Thrown when the set operation failed due to invalid view which cannot be printed. |

#### Reference

IViewSheetSet Interface

Autodesk.Revit.DB Namespace